Revit 2024 API
HardwoodApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "HardwoodApplication" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum HardwoodApplicationType
Visual Basic
Public Enumeration HardwoodApplicationType
Visual C++
public enum class HardwoodApplicationType
Members
Member name | Description
looring
urniture
See Also
Autodesk.Revit.DB.Visual Namespace